
let cnt=-1;
let txt=[
"וַֽיְהִי֙ *דְּבַר*־*יְהוָ֔ה *אֶל*־*יוֹנָ֥ה *בֶן*־*אֲמִתַּ֖י *לֵאמֹֽר׃"
," 2ק֠וּם *לֵ֧ךְ *אֶל*־*נִֽינְוֵ֛ה *הָעִ֥יר *הַגְּדוֹלָ֖ה *וּקְרָ֣א *עָלֶ֑יהָ *כִּֽי*־*עָלְתָ֥ה *רָעָתָ֖ם *לְפָנָֽי׃",
"3וַיָּ֤קָם *יוֹנָה֙ *לִבְרֹ֣חַ *תַּרְשִׁ֔ישָׁה *מִלִּפְנֵ֖י *יְהוָ֑ה *וַיֵּ֨רֶד *יָפ֜וֹ *וַיִּמְצָ֥א *אָנִיָּ֣ה *׀ *בָּאָ֣ה *תַרְשִׁ֗ישׁ *וַיִּתֵּ֨ן *שְׂכָרָ֜הּ *וַיֵּ֤רֶד *בָּהּ֙ *לָב֤וֹא *עִמָּהֶם֙ *תַּרְשִׁ֔ישָׁה *מִלִּפְנֵ֖י *יְהוָֽה׃",
"4וַֽיהוָ֗ה *הֵטִ֤יל *רֽוּחַ*־*גְּדוֹלָה֙ *אֶל*־*הַיָּ֔ם *וַיְהִ֥י *סַֽעַר*־*גָּד֖וֹל *בַּיָּ֑ם *וְהָ֣אֳנִיָּ֔ה *חִשְּׁבָ֖ה *לְהִשָּׁבֵֽר׃",
"5וַיִּֽירְא֣וּ *הַמַּלָּחִ֗ים *וַֽיִּזְעֲקוּ֮ *אִ֣ישׁ *אֶל*־*אֱלֹהָיו֒ *וַיָּטִ֨לוּ *אֶת*־*הַכֵּלִ֜ים *אֲשֶׁ֤ר *בָּֽאֳנִיָּה֙ *אֶל*־*הַיָּ֔ם *לְהָקֵ֖ל *מֵֽעֲלֵיהֶ֑ם *וְיוֹנָ֗ה *יָרַד֙ *אֶל*־*יַרְכְּתֵ֣י *הַסְּפִינָ֔ה *וַיִּשְׁכַּ֖ב *וַיֵּרָדַֽם׃",
"6וַיִּקְרַ֤ב *אֵלָיו֙ *רַ֣ב *הַחֹבֵ֔ל *וַיֹּ֥אמֶר *ל֖וֹ *מַה*־*לְּךָ֣ *נִרְדָּ֑ם *ק֚וּם *קְרָ֣א *אֶל*־*אֱלֹהֶ֔יךָ *אוּלַ֞י *יִתְעַשֵּׁ֧ת *הָאֱלֹהִ֛ים *לָ֖נוּ *וְלֹ֥א *נֹאבֵֽד׃",
"7וַיֹּאמְר֞וּ *אִ֣ישׁ *אֶל*־*רֵעֵ֗הוּ *לְכוּ֙ *וְנַפִּ֣ילָה *גֽוֹרָל֔וֹת *וְנֵ֣דְעָ֔ה *בְּשֶׁלְּמִ֛י *הָרָעָ֥ה *הַזֹּ֖את *לָ֑נוּ *וַיַּפִּ֙לוּ֙ *גּֽוֹרָל֔וֹת *וַיִּפֹּ֥ל *הַגּוֹרָ֖ל *עַל*־*יוֹנָֽה׃",
"8וַיֹּאמְר֣וּ *אֵלָ֔יו *הַגִּידָה*־*נָּ֣א *לָ֔נוּ *בַּאֲשֶׁ֛ר *לְמִי*־*הָרָעָ֥ה *הַזֹּ֖את *לָ֑נוּ *מַה*־*מְּלַאכְתְּךָ֙ *וּמֵאַ֣יִן *תָּב֔וֹא *מָ֣ה *אַרְצֶ֔ךָ *וְאֵֽי*־*מִזֶּ֥ה *עַ֖ם *אָֽתָּה׃",
"9וַיֹּ֥אמֶר *אֲלֵיהֶ֖ם *עִבְרִ֣י *אָנֹ֑כִי *וְאֶת*־*יְהוָ֞ה *אֱלֹהֵ֤י *הַשָּׁמַ֙יִם֙ *אֲנִ֣י *יָרֵ֔א *אֲשֶׁר*־*עָשָׂ֥ה *אֶת*־*הַיָּ֖ם *וְאֶת*־*הַיַּבָּשָֽׁה׃",
"10וַיִּֽירְא֤וּ *הָֽאֲנָשִׁים֙ *יִרְאָ֣ה *גְדוֹלָ֔ה *וַיֹּאמְר֥וּ *אֵלָ֖יו *מַה*־*זֹּ֣את *עָשִׂ֑יתָ *כִּֽי*־*יָדְע֣וּ *הָאֲנָשִׁ֗ים *כִּֽי*־*מִלִּפְנֵ֤י *יְהוָה֙ *ה֣וּא *בֹרֵ֔חַ *כִּ֥י *הִגִּ֖יד *לָהֶֽם׃",
"11וַיֹּאמְר֤וּ *אֵלָיו֙ *מַה*־*נַּ֣עֲשֶׂה *לָּ֔ךְ *וְיִשְׁתֹּ֥ק *הַיָּ֖ם *מֵֽעָלֵ֑ינוּ *כִּ֥י *הַיָּ֖ם *הוֹלֵ֥ךְ *וְסֹעֵֽר׃",
"12וַיֹּ֣אמֶר *אֲלֵיהֶ֗ם *שָׂא֙וּנִי֙ *וַהֲטִילֻ֣נִי *אֶל*־*הַיָּ֔ם *וְיִשְׁתֹּ֥ק *הַיָּ֖ם *מֵֽעֲלֵיכֶ֑ם *כִּ֚י *יוֹדֵ֣עַ *אָ֔נִי *כִּ֣י *בְשֶׁלִּ֔י *הַסַּ֧עַר *הַגָּד֛וֹל *הַזֶּ֖ה *עֲלֵיכֶֽם׃",
"13וַיַּחְתְּר֣וּ *הָאֲנָשִׁ֗ים *לְהָשִׁ֛יב *אֶל*־*הַיַּבָּשָׁ֖ה *וְלֹ֣א *יָכֹ֑לוּ *כִּ֣י *הַיָּ֔ם *הוֹלֵ֥ךְ *וְסֹעֵ֖ר *עֲלֵיהֶֽם׃",
"14וַיִּקְרְא֨וּ *אֶל*־*יְהוָ֜ה *וַיֹּאמְר֗וּ *אָנָּ֤ה *יְהוָה֙ *אַל*־*נָ֣א *נֹאבְדָ֗ה *בְּנֶ֙פֶשׁ֙ *הָאִ֣ישׁ *הַזֶּ֔ה *וְאַל*־*תִּתֵּ֥ן *עָלֵ֖ינוּ *דָּ֣ם *נָקִ֑יא *כִּֽי*־*אַתָּ֣ה *יְהוָ֔ה *כַּאֲשֶׁ֥ר *חָפַ֖צְתָּ *עָשִֽׂיתָ׃",
"15וַיִּשְׂאוּ֙ *אֶת*־*יוֹנָ֔ה *וַיְטִלֻ֖הוּ *אֶל*־*הַיָּ֑ם *וַיַּעֲמֹ֥ד *הַיָּ֖ם *מִזַּעְפּֽוֹ׃ ",
"16וַיִּֽירְא֧וּ *הָאֲנָשִׁ֛ים *יִרְאָ֥ה *גְדוֹלָ֖ה *אֶת*־*יְהוָ֑ה *וַיִּֽזְבְּחוּ*־*זֶ֙בַח֙ *לַֽיהוָ֔ה *וַֽיִּדְּר֖וּ *נְדָרִֽים׃" ,
"יוֹנָ֥ה בֶ",
"1וַיְמַ֤ן *יְהוָה֙ *דָּ֣ג *גָּד֔וֹל *לִבְלֹ֖עַ *אֶת־יוֹנָ֑ה *וַיְהִ֤י *יוֹנָה֙ *בִּמְעֵ֣י *הַדָּ֔ג *שְׁלֹשָׁ֥ה *יָמִ֖ים *וּשְׁלֹשָׁ֥ה *לֵילֽוֹת׃",
 "2וַיִּתְפַּלֵּ֣ל *יוֹנָ֔ה *אֶל־יְהוָ֖ה *אֱלֹהָ֑יו *מִמְּעֵ֖י *הַדָּגָֽה׃",
  "3וַיֹּ֗אמֶר *קָ֠רָאתִי *מִצָּ֥רָה *לִ֛י *אֶל־יְהוָ֖ה *וַֽיַּעֲנֵ֑נִי *מִבֶּ֧טֶן *שְׁא֛וֹל *שִׁוַּ֖עְתִּי *שָׁמַ֥עְתָּ *קוֹלִֽי׃",
   "4וַתַּשְׁלִיכֵ֤נִי *מְצוּלָה֙ *בִּלְבַ֣ב *יַמִּ֔ים *וְנָהָ֖ר *יְסֹבְבֵ֑נִי *כָּל־מִשְׁבָּרֶ֥יךָ *וְגַלֶּ֖יךָ *עָלַ֥י *עָבָֽרוּ׃",
    "5וַאֲנִ֣י *אָמַ֔רְתִּי *נִגְרַ֖שְׁתִּי *מִנֶּ֣גֶד *עֵינֶ֑יךָ *אַ֚ךְ *אוֹסִ֣יף *לְהַבִּ֔יט *אֶל־הֵיכַ֖ל *קָדְשֶֽׁךָ׃",
     "אֲפָפ֤וּנִי *מַ֙יִם֙ *עַד־נֶ֔פֶשׁ *תְּה֖וֹם *יְסֹבְבֵ֑נִי *ס֖וּף *חָב֥וּשׁ *לְרֹאשִֽׁי׃ ",
     "7לְקִצְבֵ֤י *הָרִים֙ *יָרַ֔דְתִּי *הָאָ֛רֶץ *בְּרִחֶ֥יהָ *בַעֲדִ֖י *לְעוֹלָ֑ם *וַתַּ֧עַל *מִשַּׁ֛חַת *חַיַּ֖י *יְהוָ֥ה *אֱלֹהָֽי׃",
      "8בְּהִתְעַטֵּ֤ף *עָלַי֙ *נַפְשִׁ֔י *אֶת־יְהוָ֖ה *זָכָ֑רְתִּי *וַתָּב֤וֹא *אֵלֶ֙יךָ֙ *תְּפִלָּתִ֔י *אֶל־הֵיכַ֖ל *קָדְשֶֽׁךָ׃",
       "9מְשַׁמְּרִ֖ים* הַבְלֵי־שָׁ֑וְא *חַסְדָּ֖ם *יַעֲזֹֽבוּ׃ ",
       "10וַאֲנִ֗י *בְּק֤וֹל *תּוֹדָה֙ *אֶזְבְּחָה־לָּ֔ךְ *אֲשֶׁ֥ר *נָדַ֖רְתִּי *אֲשַׁלֵּ֑מָה *יְשׁוּעָ֖תָה *לַיהוָֽה׃:",
"11וַיֹּ֥אמֶר *יְהוָ֖ה *לַדָּ֑ג *וַיָּקֵ֥א *אֶת־יוֹנָ֖ה *אֶל־הַיַּבָּשָֽׁה׃ "

]


         let engs=[5,11,19,40,52,73,87,105,120,134,149,160,176,187,204,213,224,3,12,17,27,34,43,57,64,74,80,90];

function next1(){
let test=document.getElementById("echo");
re= document.getElementById("read");
if(test.innerText===re.innerText){cnt=cnt+1;

    if (cnt>txt.length){cnt=cnt-1;}};
 update();}
                                  
function update(){                                  
settime();
clean=txt[cnt].replaceAll('*','');
re.innerText=clean;
let test=document.getElementById("echo");
test.innerText="";
engdiv=document.getElementById("english");
engdiv.innerText=engs[cnt];
keys();}

    
    function settime(){
var audio= document.getElementById("myaudio");      
      if (cnt>15){audio= document.getElementById("myaudio1")};
      
      audio.currentTime=engs[cnt];
     
      audio.play();

	console.log(audio.currentTime);
	setInterval(function(){
		if(audio.currentTime>engs[cnt+1]){
			audio.pause();
	
				}
			},1000);
		}
 

function keys(){
line1=document.getElementById("key1");
line1.innerHTML="";
myArray = txt[cnt].split("*");
butset = new Set(myArray);
let butArray = Array.from(butset);
butArray.sort();
for (let loop1= 0; loop1< butArray.length; loop1++) 
{ let btn = document.createElement("button");
btn.innerHTML = butArray[loop1];
btn.onclick = function write() {let etext=document.getElementById('echo');
etext.innerHTML = etext.innerHTML+ butArray[loop1];};
btn.classList.add("b");
line1.appendChild(btn);}
};


function fd(){cnt=cnt+1;if (cnt>txt.length){cnt=cnt-1};
update();}
    
function bk1(){ cnt=cnt-1;if (cnt<0){cnt=0};
    update(); }

function hd() {if (re.style.visibility==="visible"){re.style.visibility="hidden";}
else{re.style.visibility="visible";}}

function engvis() {if (engdiv.style.visibility==="visible"){engdiv.style.visibility="hidden";}
else{engdiv.style.visibility="visible";}}

function clr(){let str=document.getElementById("echo");
del= str.innerText.slice(0, -1);
str.innerText=del;}
